# Parameter Type Id System Zone Area Property

Source: https://www.revitapidocs.com/2026/9ec59486-c7ff-50c4-1c72-f5751f9334b1.htm

---

| Parameter Type Id System Zone Area Property |
| --- |

"System\-Zone Area"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId SystemZoneArea { get; }
```

```
Public Shared ReadOnly Property SystemZoneArea As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ SystemZoneArea {
	ForgeTypeId^ get ();
}
```

```
static member SystemZoneArea : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace